// 声明并创建了变量

// 这两种结构虽然成员列表完全一样，但两者是完全不同的类型，所以下面的语句是非法的
// z = &x;
struct {
	int a;
	char b;
} x;

struct {
	int a ;
	char b;
} y[10] , * z;


/************************************************************************/
/*   只声明（这里其实是声明结构标签），后创建变量                       */
/************************************************************************/ 

struct sim{
	int a;
	char b;
};

struct sim x;
struct sim y[10], *z;
// 合法的
z = &x;

/************************************************************************/
/* 声明一种类型                                                         */
/************************************************************************/

typedef struct{
	int a;
	char b;
} sim_t;

sim_t x;
sim_t y[10], * z;
// 合法
z = &x;